export type Ayah = {
  id: string;
  text: string;
  surah: string;
  number: number | string;
};

export const ayahs: Ayah[] = [
  {
    id: 'a1',
    text: 'قُلْ هُوَ اللَّهُ أَحَدٌ ۞ اللَّهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُولَدْ ۞ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ',
    surah: 'سورة الإخلاص',
    number: 1,
  },
  {
    id: 'a2',
    text: 'الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ۞ الرَّحْمَنِ الرَّحِيمِ ۞ مَالِكِ يَوْمِ الدِّينِ',
    surah: 'سورة الفاتحة',
    number: 1,
  },
  {
    id: 'a3',
    text: 'اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ',
    surah: 'سورة البقرة (آية الكرسي)',
    number: 255,
  },
  {
    id: 'a4',
    text: 'إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ ۞ فَصَلِّ لِرَبِّكَ وَانْحَرْ ۞ إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ',
    surah: 'سورة الكوثر',
    number: 1,
  },
  {
    id: 'a5',
    text: 'وَالضُّحَى ۞ وَاللَّيْلِ إِذَا سَجَى ۞ مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى',
    surah: 'سورة الضحى',
    number: 1,
  },
  {
    id: 'a6',
    text: 'إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ ۞ وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا',
    surah: 'سورة النصر',
    number: 1,
  },
];
